controllers/DepositController.php

    public function actionCreate()
    {
        $model = new Deposit();

        if ($this->request->isPost) {
            if ($model->load($this->request->post()) && $model->save()) {
---
INSERT INTO `deposit` (`deposit_id`, `deposit_value`, `deposit_date`, `deposit_reason`) VALUES (7, 90000, '2022/03/14', 'full payment for biryani chicken')
SELECT EXISTS(SELECT * FROM `deposit` WHERE `deposit`.`deposit_id`='7')

    public function actionUpdate($deposit_id)
    {
        $model = $this->findModel($deposit_id);

        if ($this->request->isPost && $model->load($this->request->post()) && $model->save()) {
---
UPDATE `deposit` SET `deposit_id`=2, `deposit_value`=5000, `deposit_reason`='full payment for chicken' WHERE `deposit_id`=2

    protected function findModel($deposit_id)
    {
        if (($model = Deposit::findOne(['deposit_id' => $deposit_id])) !== null) {
---
SELECT * FROM `deposit` WHERE `deposit_id`='2'